public class Main {
        public static void main(String[] args) {

            //Входные данные

            int sum = 5000;
            int part = 20;

            //Логика

            int bonus = sum / part;

            System.out.println("При покупке билета стоимостью " + sum + " руб., Ваш бонус составит " + bonus + " бонусных миль.");
        }
    }
